Revit 2027 API
MacroLanguageType Enumeration
 The Macro language types.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MacroLanguageType
Public Enumeration MacroLanguageType
public enum class MacroLanguageType
type MacroLanguageType
Members
Member name | Value | Description
CSharp | 1 |  The C# language.
See Also
Reference
Autodesk.Revit.DB.Macros Namespace